# Reshaping

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe1=DataFrame(np.arange(8).reshape(2,4),
                 index=pd.Index(["MAA","TRZ"],name="city"),
                 columns=pd.Index(["X","Y","Z","W"],name="letter"))
dframe1

letter  X  Y  Z  W
city
MAA     0  1  2  3
TRZ     4  5  6  7

In [4]:
dframe_st=dframe1.stack() # Displays the elements of the DF more similarly to a Series 
dframe_st # This might be easier to view

city  letter
MAA   X         0
      Y         1
      Z         2
      W         3
TRZ   X         4
      Y         5
      Z         6
      W         7
dtype: int32

## Rearranging the pivoted data

In [5]:
dframe_st.unstack()

letter  X  Y  Z  W
city
MAA     0  1  2  3
TRZ     4  5  6  7

In [8]:
dframe_st.unstack("city") # Places the given index on the top of the DF

city    MAA  TRZ
letter
X         0    4
Y         1    5
Z         2    6
W         3    7

## Stack handling - Null Values

In [9]:
sales1 = Series([10000,20000,30000],index=["East","West","South"])
sales1

East     10000
West     20000
South    30000
dtype: int64

In [10]:
sales2 = Series([40000,50000,60000],index=["East","North","South"])
sales2

East     40000
North    50000
South    60000
dtype: int64

In [11]:
dframe_sales = pd.concat([sales1,sales2],keys=["Alpha","Beta"])
dframe_sales

Alpha  East     10000
       West     20000
       South    30000
Beta   East     40000
       North    50000
       South    60000
dtype: int64

In [12]:
dframe_sales.unstack()

          East    North    South     West
Alpha  10000.0      NaN  30000.0  20000.0
Beta   40000.0  50000.0  60000.0      NaN

In [16]:
dframe_sales.unstack().stack(dropna=False)

Alpha  East     10000.0
       North        NaN
       South    30000.0
       West     20000.0
Beta   East     40000.0
       North    50000.0
       South    60000.0
       West         NaN
dtype: float64